In [2]:
import numpy as np
import pandas as pd

In [3]:
# Series
# Array de una sola dimension indexado
# pueden ser traidos de una serie
data = pd.Series([0.25, 0.5, 0.75, 1.0, 1.3])
data

0    0.25
1    0.50
2    0.75
3    1.00
4    1.30
dtype: float64

In [5]:
print(data.values)
print(data.index)
print(data[1])

[0.25 0.5  0.75 1.   1.3 ]
RangeIndex(start=0, stop=5, step=1)
0.5

In [6]:
print(data)
print(data[2:]) # imprimir desde el indice 2

0    0.25
1    0.50
2    0.75
3    1.00
4    1.30
dtype: float64
2    0.75
3    1.00
4    1.30
dtype: float64

In [8]:
### ``Series`` como generalizaci√≥n de un array de  NumPy 
data_2 = pd.Series([0.25, 0.5, 0.75, 1.0],
                    index=["a","b","c","d"])  # No es necesario que sea en orden cuando son numeros
print(data_2)
print(data_2["b"])

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64
0.5

In [3]:
poblacion_dict = {'California': 38332521,
                'Texas': 26448193,
                'New York': 19651127,
                'Florida': 19552860,
                'Illinois': 12882135}
poblacion = pd.Series(poblacion_dict)
print(poblacion)

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [4]:
poblacion.values

array([38332521, 26448193, 19651127, 19552860, 12882135], dtype=int64)

In [5]:
poblacion.index
# el indice entonces son las keys del diccionario

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [6]:
poblacion["California":"New York"]

California    38332521
Texas         26448193
New York      19651127
dtype: int64

In [8]:
Listado_Estados = ["Illinois","Texas","New York","Florida","California"]
Estados_Poblacion = [12882135,26448193,19651127,19552860,38332521]
# nombre = pd.Series es la forma de crear el framework unir dos series
estados = pd.Series(Estados_Poblacion,index=Listado_Estados)

In [9]:
estados

Illinois      12882135
Texas         26448193
New York      19651127
Florida       19552860
California    38332521
dtype: int64

In [10]:
# creado desde un arreglo el comando index es opcional
a = pd.Series([2,4,6])
print(a)

0    2
1    4
2    6
dtype: int64

In [12]:
# un escalar repetido a lo largo de un indice
a = pd.Series(5,index=[100,200,300])
a

100    5
200    5
300    5
dtype: int64

In [13]:
a = pd.Series({2:"a",1:"b",3:"c"})
a

2    a
1    b
3    c
dtype: object

In [14]:
a = pd.Series({2:"a",1:"b",3:"c"},index=[3,2])
a

3    c
2    a
dtype: object

In [15]:
Estados_area_dicc = {"California":423967,"Texas":695662,"New York":141297,"Florida":170312,"Illinois":np.nan}
area = pd.Series(Estados_area_dicc)
area

California    423967.0
Texas         695662.0
New York      141297.0
Florida       170312.0
Illinois           NaN
dtype: float64

In [16]:
estados

Illinois      12882135
Texas         26448193
New York      19651127
Florida       19552860
California    38332521
dtype: int64

In [17]:
data_estados = pd.DataFrame({"Poblacion":estados,"Area":area})
data_estados

            Poblacion      Area
California   38332521  423967.0
Florida      19552860  170312.0
Illinois     12882135       NaN
New York     19651127  141297.0
Texas        26448193  695662.0

In [18]:
data_estados.index

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

In [19]:
data_estados.columns

Index(['Poblacion', 'Area'], dtype='object')

In [22]:
data_estados["Poblacion"]

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
Name: Poblacion, dtype: int64

In [23]:
data_estados["Densidad"] = data_estados["Poblacion"] / data_estados["Area"]
data_estados

            Poblacion      Area    Densidad
California   38332521  423967.0   90.413926
Florida      19552860  170312.0  114.806121
Illinois     12882135       NaN         NaN
New York     19651127  141297.0  139.076746
Texas        26448193  695662.0   38.018740

In [24]:
poblacion

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [25]:
pd.DataFrame(poblacion,columns=["Poblacion"])

            Poblacion
California   38332521
Texas        26448193
New York     19651127
Florida      19552860
Illinois     12882135

In [26]:
data_3 = [{"a": i, "b": i * 2 }
            for i in range(10)]
pd.DataFrame(data_3)

   a   b
0  0   0
1  1   2
2  2   4
3  3   6
4  4   8
5  5  10
6  6  12
7  7  14
8  8  16
9  9  18

In [27]:
pd.DataFrame(np.random.rand(3,2),columns=["Columna a","Columna b"],index=['a','b','c'])

   Columna a  Columna b
a   0.807171   0.401751
b   0.680741   0.871531
c   0.255795   0.038841

In [28]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [29]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [31]:
Indices_A=pd.Index([1,3,5,7,9])
Indices_B=pd.Index([2,3,5,7,11])

In [32]:
Indices_A & Indices_B

C:\Users\araqu\AppData\Local\Temp\ipykernel_11244\4138969955.py:1: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead.
  Indices_A & Indices_B

Int64Index([3, 5, 7], dtype='int64')

In [33]:
Indices_A | Indices_B

C:\Users\araqu\AppData\Local\Temp\ipykernel_11244\792896099.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  Indices_A | Indices_B

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [35]:
Indices_A ^ Indices_B

C:\Users\araqu\AppData\Local\Temp\ipykernel_11244\482358375.py:1: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead.
  Indices_A ^ Indices_B

Int64Index([1, 2, 9, 11], dtype='int64')

In [36]:
import pandas as pd

In [37]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [38]:
animales = ['Tortuga', 'Zorro', 'Paloma', 'Elefante']
tipo = ['reptil', 'mam√≠fero', 'ave', 'mam√≠fero']
obj = pd.Series(tipo,index=animales)
obj

Tortuga       reptil
Zorro       mam√≠fero
Paloma           ave
Elefante    mam√≠fero
dtype: object

In [39]:
d = {'tipo_vivienda': ['casa', 'departamento'], 'm2': [35, 49]}
df = pd.DataFrame(data=d)
df

  tipo_vivienda  m2
0          casa  35
1  departamento  49

In [43]:
data_frame_01 = pd.read_csv("fifa-statistics.csv")
data_frame_01

,Date,Team,Opponent,Goal Scored,Ball Possession %,Attempts,On-Target,Off-Target,Blocked,Corners,...,Yellow Card,Yellow & Red,Red,Man of the Match,1st Goal,Round,PSO,Goals in PSO,Own goals,Own goal Time
0,14-06-2018,Russia,Saudi Arabia,5,40,13,7,3,3,6,...,0,0,0,Yes,12.0,Group Stage,No,0,NaN,NaN
1,14-06-2018,Saudi Arabia,Russia,0,60,6,0,3,3,2,...,0,0,0,No,NaN,Group Stage,No,0,NaN,NaN
2,15-06-2018,Egypt,Uruguay,0,43,8,3,3,2,0,...,2,0,0,No,NaN,Group Stage,No,0,NaN,NaN
3,15-06-2018,Uruguay,Egypt,1,57,14,4,6,4,5,...,0,0,0,Yes,89.0,Group Stage,No,0,NaN,NaN
4,15-06-2018,Morocco,Iran,0,64,13,3,6,4,5,...,1,0,0,No,NaN,Group Stage,No,0,1.0,90.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
123,11-07-2018,England,Croatia,1,46,11,1,6,4,4,...,1,0,0,No,5.0,Semi- Finals,No,0,NaN,NaN
124,14-07-2018,Belgium,England,2,43,12,4,3,5,4,...,1,0,0,Yes,4.0,3rd Place,No,0,NaN,NaN
125,14-07-2018,England,Belgium,0,57,15,5,7,3,5,...,2,0,0,No,NaN,3rd Place,No,0,NaN,NaN
126,15-07-2018,France,Croatia,4,39,8,6,1,1,2,...,2,0,0,Yes,18.0,Final,No,0,1.0,18.0
127,15-07-2018,Croatia,France,2,61,15,3,8,4,6,...,1,0,0,No,28.0,Final,No,0,NaN,NaN

In [45]:
data_frame_01.loc[0, 'Team']

'Russia'

In [46]:
data_frame_01.iloc[0,[1]]

Team    Russia
Name: 0, dtype: object

In [47]:
data_frame_01.iloc[2]

Date                       15-06-2018
Team                            Egypt
Opponent                      Uruguay
Goal Scored                         0
Ball Possession %                  43
Attempts                            8
On-Target                           3
Off-Target                          3
Blocked                             2
Corners                             0
Offsides                            1
Free Kicks                          7
Saves                               3
Pass Accuracy %                    78
Passes                            395
Distance Covered (Kms)            112
Fouls Committed                    12
Yellow Card                         2
Yellow & Red                        0
Red                                 0
Man of the Match                   No
1st Goal                          NaN
Round                     Group Stage
PSO                                No
Goals in PSO                        0
Own goals                         NaN
Own goal Time                     NaN
Name: 2, dtype: object